In [1]:
# https://dplyr.tidyverse.org/reference/mutate-joins.html
%run nb_helpers.py

from datar.data import band_members, band_instruments, band_instruments2
from datar.all import *

nb_header(inner_join, left_join, right_join, full_join, book='mutate-joins')

### <div style="background-color: #EEE; padding: 5px 0 8px 0">★ inner_join</div>

##### Inner join two data frames by matching rows.

The original API:
https://dplyr.tidyverse.org/reference/join.html

##### Args:
&emsp;&emsp;`x`: A data frame
&emsp;&emsp;`y`: A data frame
&emsp;&emsp;`by`: A list of column names to join by.
&emsp;&emsp;&emsp;&emsp;If None, use the intersection of the columns of x and y.

&emsp;&emsp;`copy`: If True, always copy the data.
&emsp;&emsp;`suffix`: A tuple of suffixes to apply to overlapping columns.
&emsp;&emsp;`keep`: If True, keep the grouping variables in the output.

##### Returns:
&emsp;&emsp;A data frame

### <div style="background-color: #EEE; padding: 5px 0 8px 0">★ left_join</div>

##### Left join two data frames by matching rows.

The original API:
https://dplyr.tidyverse.org/reference/join.html

##### Args:
&emsp;&emsp;`x`: A data frame
&emsp;&emsp;`y`: A data frame
&emsp;&emsp;`by`: A list of column names to join by.
&emsp;&emsp;&emsp;&emsp;If None, use the intersection of the columns of x and y.

&emsp;&emsp;`copy`: If True, always copy the data.
&emsp;&emsp;`suffix`: A tuple of suffixes to apply to overlapping columns.
&emsp;&emsp;`keep`: If True, keep the grouping variables in the output.

##### Returns:
&emsp;&emsp;A data frame

### <div style="background-color: #EEE; padding: 5px 0 8px 0">★ right_join</div>

##### Right join two data frames by matching rows.

The original API:
https://dplyr.tidyverse.org/reference/join.html

##### Args:
&emsp;&emsp;`x`: A data frame
&emsp;&emsp;`y`: A data frame
&emsp;&emsp;`by`: A list of column names to join by.
&emsp;&emsp;&emsp;&emsp;If None, use the intersection of the columns of x and y.

&emsp;&emsp;`copy`: If True, always copy the data.
&emsp;&emsp;`suffix`: A tuple of suffixes to apply to overlapping columns.
&emsp;&emsp;`keep`: If True, keep the grouping variables in the output.

##### Returns:
&emsp;&emsp;A data frame

### <div style="background-color: #EEE; padding: 5px 0 8px 0">★ full_join</div>

##### Full join two data frames by matching rows.

The original API:
https://dplyr.tidyverse.org/reference/join.html

##### Args:
&emsp;&emsp;`x`: A data frame
&emsp;&emsp;`y`: A data frame
&emsp;&emsp;`by`: A list of column names to join by.
&emsp;&emsp;&emsp;&emsp;If None, use the intersection of the columns of x and y.

&emsp;&emsp;`copy`: If True, always copy the data.
&emsp;&emsp;`suffix`: A tuple of suffixes to apply to overlapping columns.
&emsp;&emsp;`keep`: If True, keep the grouping variables in the output.

##### Returns:
&emsp;&emsp;A data frame

In [2]:
band_members >> inner_join(band_instruments)

      name     band    plays
  <object> <object> <object>
0     John  Beatles   guitar
1     Paul  Beatles     bass

In [3]:
band_members >> left_join(band_instruments)

      name     band    plays
  <object> <object> <object>
0     Mick   Stones      NaN
1     John  Beatles   guitar
2     Paul  Beatles     bass

In [4]:
band_members >> right_join(band_instruments)

      name     band    plays
  <object> <object> <object>
0     John  Beatles   guitar
1     Paul  Beatles     bass
2    Keith      NaN   guitar

In [5]:
band_members >> full_join(band_instruments)

      name     band    plays
  <object> <object> <object>
0     Mick   Stones      NaN
1     John  Beatles   guitar
2     Paul  Beatles     bass
3    Keith      NaN   guitar

In [6]:
band_members >> inner_join(band_instruments, by=f.name)

      name     band    plays
  <object> <object> <object>
0     John  Beatles   guitar
1     Paul  Beatles     bass

In [7]:
band_members >> full_join(band_instruments2, by={'name': 'artist'})

      name     band    plays
  <object> <object> <object>
0     Mick   Stones      NaN
1     John  Beatles   guitar
2     Paul  Beatles     bass
3      NaN      NaN   guitar

In [8]:
band_members >> full_join(band_instruments2, by={'name': 'artist'}, keep=True)

      name     band   artist    plays
  <object> <object> <object> <object>
0     Mick   Stones      NaN      NaN
1     John  Beatles     John   guitar
2     Paul  Beatles     Paul     bass
3      NaN      NaN    Keith   guitar

In [9]:
df1 = tibble(x=[1,2,3])
df2 = tibble(x=[1,1,2], y=["first", "second", "third"])
df1 >> left_join(df2)

        x        y
  <int64> <object>
0       1    first
1       1   second
2       2    third
3       3      NaN

In [10]:
df1 = tibble(x=[1, NA], y=2)
df2 = tibble(x=[1, NA], z=3)
left_join(df1, df2) # na_matches not supported yet

          x       y       z
  <float64> <int64> <int64>
0       1.0       2       3
1       NaN       2       3